common/modules/advertisement/models/TextAdvert.php

SELECT * FROM `partners` WHERE `id`='1'
---
    public function checkBalls()
    {
		$model = Partners::findOne($this->partner_id);