common/modules/seo/widgets/CounterWidget.php

	protected function renderItem()
	{
		$counter = '';

		if($this->counter_name != '')
		{
			$counter = (Settings::find()->select('value')->where(['name'=>$this->counter_name]) !== null) ? Settings::find()->select('value')->where(['name'=>$this->counter_name])->one() : '';
---
SELECT `value` FROM `settings` WHERE `name`='liveinternet'