common/modules/backoffice/models/Partners.php

SELECT * FROM `partners` WHERE id = 1 AND status >= 1
---
    public static function findIdentity($id)
    {
        /*return static::findOne([
			'id' => $id,
			'status' => self::STATUS_ACTIVE
       ]);*/