common/models/Menu.php

	public static function getSubmenuList($categoryID, $backoffice)
    {
		$result = array();
		$submenuList = self::find()->select(['parent_id', 'name', 'url'])->where('parent_id > 0 AND category_id = :category_id AND status != :status', [':category_id'=>$categoryID, ':status'=>0])->asArray()->all();
---
SELECT `parent_id`, `name`, `url` FROM `menu` WHERE parent_id > 0 AND category_id = 1 AND status != 0

	public static function getMenuList($categoryID, $backoffice = false, $front = true, $image = 'frontend_images')
    {
		$result = [];
		$menuList = self::find()->select(['id', 'parent_id', 'name', 'partner_status',  'url',  'iso'])->where('parent_id = 0 AND category_id = :category_id AND status != :status', ['category_id'=>$categoryID, 'status'=>0])->asArray()->all();
		$submenuList = self::getSubmenuList($categoryID, $backoffice);

		if($backoffice)
		{
			$id = (!is_null(\Yii::$app->user->identity)) ? \Yii::$app->user->identity->id : 0;
			$partnerData = (Partners::find()->select(['status'])->where(['id'=>$id]) !== null) ? Partners::find()->select(['status'])->where(['id'=>$id])->one() : null;
---
SELECT `id`, `parent_id`, `name`, `partner_status`, `url`, `iso` FROM `menu` WHERE parent_id = 0 AND category_id = 1 AND status != 0
SELECT `status` FROM `partners` WHERE `id`=1