common/models/Service.php

	public static function isActionAllowed($action)
    {
		$data = Settings::find(['value'])->where(['name'=>$action])->one();
---
SELECT * FROM `settings` WHERE `name`='is_tickets_allowed'