common/modules/tickets/models/TicketsMessages.php

	public function getMessagesCountByPartnerID($id)
    {
		$result = self::find()
		->from('tickets')
		->leftJoin('tickets_messages', 'tickets_messages.ticket_id = tickets.id')
		->where(['`tickets`.`partner_id`'=>$id, '`tickets_messages`.`type`'=>self::ADMIN_TYPE])->count();
---
SELECT COUNT(*) FROM `tickets` LEFT JOIN `tickets_messages` ON tickets_messages.ticket_id = tickets.id WHERE (`tickets`.`partner_id`=1) AND (`tickets_messages`.`type`=2)