common/modules/advertisement/controllers/FrontendTextAdvertController.php

    public function beforeAction($event)
    {
		$id = (!is_null(\Yii::$app->user->identity)) ? \Yii::$app->user->identity->id : 0;

		$this->view->params['tickets_list'] = Tickets::find()->where('partner_id=:id AND status=:status', [':id' => $id, ':status' => Tickets::STATUS_ADMIN_ANSWER])->all();
		$ticketsModel = new TicketsMessages();
		$this->view->params['tickets_count'] = $ticketsModel->getMessagesCountByPartnerID($id);
		$this->view->params['tickets_mesages_count'] = Tickets::find()->where('partner_id=:id AND status=:status', [':id' => $id, ':status' => Tickets::STATUS_ADMIN_ANSWER])->count();
---
SELECT * FROM `tickets` WHERE partner_id=1 AND status=1
SELECT COUNT(*) FROM `tickets` WHERE partner_id=1 AND status=1

    public function actionIndex()
    {
		$id = (!is_null(\Yii::$app->user->identity)) ? \Yii::$app->user->identity->id : 0;
		$this->user_id = $id;
		$this->identity_id = $id;

        $advertList = new ActiveDataProvider([
			'query' => TextAdvert::find()
			           ->where('status > 0')
			           ->andWhere('counter > 0')
			           ->orderBy('created_at DESC'),
			'pagination' => [
				'pageSize' => Service::getPageSize(),
			],
		]);

        $content = (!is_null(StaticContent::find()->where(['name'=>'text_advert']))) ? StaticContent::find()->where(['name'=>'text_advert'])->one() : null;
---
SELECT * FROM `static_content` WHERE `name`='text-advert'

    public function actionPartnerAdvertList()
    {
		$id = (!is_null(\Yii::$app->user->identity)) ? \Yii::$app->user->identity->id : 0;
		$this->user_id = $id;
		$this->identity_id = $id;

		$searchModel = new TextAdvertSearch();
        $dataProvider = $searchModel->search($id, Yii::$app->request->post());
        $dataProvider->pagination->pageSize = Service::getPageSize();
        $content = (!is_null(StaticContent::find()->where(['name'=>'text_advert']))) ? StaticContent::find()->where(['name'=>'text_advert'])->one() : null;
---
SELECT * FROM `static_content` WHERE `name`='text_advert'

    public function actionCreate()
    {
		$id = (!is_null(\Yii::$app->user->identity)) ? \Yii::$app->user->identity->id : 0;
		$this->user_id = $id;
		$this->identity_id = $id;

        $model = new TextAdvert();
		$this->view->params['title'] = Yii::t('form', 'Добавить объявление');

        if($model->load(Yii::$app->request->post()))
        {
	        $model->counter = $model->balls;
			$class = 'error';
			$msg = Yii::t('messages', 'Ошибка!');

			if($model->save())
---
INSERT INTO `text_advert` (`title`, `link`, `text`, `balls`, `partner_id`, `counter`, `created_at`) VALUES ('test1_9', 'https://www.29usd.com', 'test1_9', 900, 1, 900, 1688397303)